Revit 2027 API
ReferencePoint.GetInterpolatingCurves Method
The set of CurveByPoints elements that interpolate a ReferencePoint.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public CurveByPointsArray GetInterpolatingCurves()
Public Function GetInterpolatingCurves As CurveByPointsArray
public:
CurveByPointsArray^ GetInterpolatingCurves()
member GetInterpolatingCurves : unit -> CurveByPointsArray
Return Value
CurveByPointsArray
Remarks
A CurveByPoints is in the GetInterpolatingCurves() array if and only if the ReferencePoint is in the Points array of CurveByPoints.
See Also
Reference
ReferencePoint Class
Autodesk.Revit.DB Namespace